  DEFINE GDG (NAME(HUB.MERGE.EXTRACT) LIMIT(7) SCRATCH)
  DEFINE GDG (NAME(HUB.MERGE.SORTED) LIMIT(7) SCRATCH)
  DEFINE GDG (NAME(HUB.GL.FEED) LIMIT(15) SCRATCH)
  IF LASTCC=12 THEN SET MAXCC=0
