//BKPSTPR  PROC CYCLE=,MODE=RESTART
//* DDA post PROC. Do NOT use COND=EVEN on STEPPST.
//STEPCYC  EXEC PGM=BKCKP01
//STEPLIB  DD   DSN=HUB.LOAD,DISP=SHR
//UDUMMY   DD   DUMMY
//SYSIN    DD   *
POSTING
/*
//STEPPST  EXEC PGM=BKPST01,COND=(4,LT,STEPCYC)
//STEPLIB  DD   DSN=HUB.LOAD,DISP=SHR
//URST     DD   DSN=HUB.RESTART.D&CYCLE,DISP=SHR
//SYSIN    DD   *
&MODE
/*
//SYSUDUMP DD   SYSOUT=*
//         PEND
