BKACMS    DFHMSD TYPE=&SYSPARM,MODE=INOUT,LANG=COBOL,
               STORAGE=AUTO,TIOAPFX=YES,CTRL=(FREEKB,FRSET)
BKACMSS   DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,CTRL=(FREEKB,FRSET)
TTL      DFHMDF POS=(01,01),LENGTH=08,ATTRB=(ASKIP,BRT),
               INITIAL='BKACMS'
TTL2     DFHMDF POS=(01,30),LENGTH=20,
               ATTRB=(ASKIP,BRT),INITIAL='ACCOUNT OPEN / MAINT'
LINE2    DFHMDF POS=(02,01),LENGTH=78,ATTRB=ASKIP,
               INITIAL='------------------------------------------------------------------------------'
LBLCIF   DFHMDF POS=(04,02),LENGTH=10,ATTRB=ASKIP,INITIAL='CIF.......'
CIFNO    DFHMDF POS=(04,14),LENGTH=10,ATTRB=(UNPROT,IC,FSET)
S1A      DFHMDF POS=(04,25),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLNAM   DFHMDF POS=(05,02),LENGTH=10,ATTRB=ASKIP,INITIAL='NAME......'
CNAME    DFHMDF POS=(05,14),LENGTH=30,ATTRB=(UNPROT,FSET)
S1B      DFHMDF POS=(05,45),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLBR    DFHMDF POS=(06,02),LENGTH=10,ATTRB=ASKIP,INITIAL='BRANCH....'
BRNO     DFHMDF POS=(06,14),LENGTH=06,ATTRB=(UNPROT,FSET)
S1C      DFHMDF POS=(06,21),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLRGN   DFHMDF POS=(06,24),LENGTH=08,ATTRB=ASKIP,INITIAL='REGION..'
RGN      DFHMDF POS=(06,33),LENGTH=04,ATTRB=(UNPROT,FSET)
S1D      DFHMDF POS=(06,38),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLTYP   DFHMDF POS=(07,02),LENGTH=10,ATTRB=ASKIP,INITIAL='PROD......'
PROD     DFHMDF POS=(07,14),LENGTH=04,ATTRB=(UNPROT,FSET),INITIAL='DDA '
S1E      DFHMDF POS=(07,19),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLCCY   DFHMDF POS=(07,24),LENGTH=08,ATTRB=ASKIP,INITIAL='CCY.....'
CCY      DFHMDF POS=(07,33),LENGTH=03,ATTRB=(UNPROT,FSET),INITIAL='USD'
S1F      DFHMDF POS=(07,37),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLOPN   DFHMDF POS=(08,02),LENGTH=10,ATTRB=ASKIP,INITIAL='OPEN AMT..'
OPNAMT   DFHMDF POS=(08,14),LENGTH=15,ATTRB=(UNPROT,FSET,NUM)
S1G      DFHMDF POS=(08,30),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLSTS   DFHMDF POS=(09,02),LENGTH=10,ATTRB=ASKIP,INITIAL='STATUS....'
STS      DFHMDF POS=(09,14),LENGTH=01,ATTRB=(UNPROT,FSET),INITIAL='O'
S1H      DFHMDF POS=(09,16),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLACC   DFHMDF POS=(11,02),LENGTH=10,ATTRB=ASKIP,INITIAL='ACCT NO...'
ACCNO    DFHMDF POS=(11,14),LENGTH=06,ATTRB=ASKIP
LBLKCY   DFHMDF POS=(12,02),LENGTH=10,ATTRB=ASKIP,INITIAL='KYC.......'
KYC      DFHMDF POS=(12,14),LENGTH=01,ATTRB=(UNPROT,FSET)
S1I      DFHMDF POS=(12,16),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
MSG      DFHMDF POS=(22,01),LENGTH=78,ATTRB=(ASKIP,BRT)
FKEY     DFHMDF POS=(24,01),LENGTH=78,ATTRB=ASKIP,
               INITIAL='ENTER=PROCESS  PF3=END  PF9=OVERRIDE  CLEAR=CANCEL'
         DFHMSD TYPE=FINAL
         END
