BKATMS    DFHMSD TYPE=&SYSPARM,MODE=INOUT,LANG=COBOL,
               STORAGE=AUTO,TIOAPFX=YES,CTRL=(FREEKB,FRSET)
BKATMSS   DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,CTRL=(FREEKB,FRSET)
TTL      DFHMDF POS=(01,01),LENGTH=08,ATTRB=(ASKIP,BRT),
               INITIAL='BKATMS'
TTL2     DFHMDF POS=(01,29),LENGTH=21,
               ATTRB=(ASKIP,BRT),INITIAL='ATM ADVICE / REVERSAL'
LINE2    DFHMDF POS=(02,01),LENGTH=78,ATTRB=ASKIP,
               INITIAL='------------------------------------------------------------------------------'
LBLTRC   DFHMDF POS=(04,02),LENGTH=12,ATTRB=ASKIP,INITIAL='TRACE.......'
TRACE    DFHMDF POS=(04,16),LENGTH=26,ATTRB=(UNPROT,IC,FSET)
S2A      DFHMDF POS=(04,43),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLPAN   DFHMDF POS=(05,02),LENGTH=12,ATTRB=ASKIP,INITIAL='PAN HASH....'
PANH     DFHMDF POS=(05,16),LENGTH=16,ATTRB=(UNPROT,FSET)
S2B      DFHMDF POS=(05,33),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLTRM   DFHMDF POS=(06,02),LENGTH=12,ATTRB=ASKIP,INITIAL='ATM TERM....'
TERMID   DFHMDF POS=(06,16),LENGTH=08,ATTRB=(UNPROT,FSET)
S2C      DFHMDF POS=(06,25),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLAMT   DFHMDF POS=(07,02),LENGTH=12,ATTRB=ASKIP,INITIAL='DISPENSE....'
AMT      DFHMDF POS=(07,16),LENGTH=15,ATTRB=(UNPROT,FSET,NUM)
S2D      DFHMDF POS=(07,32),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLCASS  DFHMDF POS=(08,02),LENGTH=12,ATTRB=ASKIP,INITIAL='CASSETTE....'
CASS     DFHMDF POS=(08,16),LENGTH=04,ATTRB=(UNPROT,FSET)
S2E      DFHMDF POS=(08,21),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLREV   DFHMDF POS=(09,02),LENGTH=12,ATTRB=ASKIP,INITIAL='REVERSAL OF.'
REVOF    DFHMDF POS=(09,16),LENGTH=26,ATTRB=(UNPROT,FSET)
S2F      DFHMDF POS=(09,43),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLACT   DFHMDF POS=(10,02),LENGTH=12,ATTRB=ASKIP,INITIAL='ACTION......'
ACTN     DFHMDF POS=(10,16),LENGTH=01,ATTRB=(UNPROT,FSET),INITIAL='D'
S2G      DFHMDF POS=(10,18),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
HINT     DFHMDF POS=(12,02),LENGTH=50,ATTRB=ASKIP,INITIAL='D=DISPENSE  R=REVERSAL (must match TRACE)'
MSG      DFHMDF POS=(22,01),LENGTH=78,ATTRB=(ASKIP,BRT)
FKEY     DFHMDF POS=(24,01),LENGTH=78,ATTRB=ASKIP,
               INITIAL='ENTER=PROCESS  PF3=END  PF9=OVERRIDE  CLEAR=CANCEL'
         DFHMSD TYPE=FINAL
         END
