BKCAMS    DFHMSD TYPE=&SYSPARM,MODE=INOUT,LANG=COBOL,
               STORAGE=AUTO,TIOAPFX=YES,CTRL=(FREEKB,FRSET)
BKCAMSS   DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,CTRL=(FREEKB,FRSET)
TTL      DFHMDF POS=(01,01),LENGTH=08,ATTRB=(ASKIP,BRT),
               INITIAL='BKCAMS'
TTL2     DFHMDF POS=(01,29),LENGTH=22,
               ATTRB=(ASKIP,BRT),INITIAL='CTR LARGE-CASH CAPTURE'
LINE2    DFHMDF POS=(02,01),LENGTH=78,ATTRB=ASKIP,
               INITIAL='------------------------------------------------------------------------------'
LBLCIF   DFHMDF POS=(04,02),LENGTH=12,ATTRB=ASKIP,INITIAL='CIF.........'
CIFNO    DFHMDF POS=(04,16),LENGTH=10,ATTRB=(UNPROT,IC,FSET)
S11A     DFHMDF POS=(04,27),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLACC   DFHMDF POS=(05,02),LENGTH=12,ATTRB=ASKIP,INITIAL='ACCOUNT.....'
ACCNO    DFHMDF POS=(05,16),LENGTH=06,ATTRB=(UNPROT,FSET)
S11B     DFHMDF POS=(05,23),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLIN    DFHMDF POS=(06,02),LENGTH=12,ATTRB=ASKIP,INITIAL='CASH IN.....'
CASHIN   DFHMDF POS=(06,16),LENGTH=15,ATTRB=(UNPROT,FSET,NUM)
S11C     DFHMDF POS=(06,32),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLOUT   DFHMDF POS=(07,02),LENGTH=12,ATTRB=ASKIP,INITIAL='CASH OUT....'
CASHOUT  DFHMDF POS=(07,16),LENGTH=15,ATTRB=(UNPROT,FSET,NUM)
S11D     DFHMDF POS=(07,32),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLOCC   DFHMDF POS=(09,02),LENGTH=12,ATTRB=ASKIP,INITIAL='OCCUPATION..'
OCC      DFHMDF POS=(09,16),LENGTH=30,ATTRB=(UNPROT,FSET)
S11E     DFHMDF POS=(09,47),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLSRC   DFHMDF POS=(10,02),LENGTH=12,ATTRB=ASKIP,INITIAL='SRC FUNDS...'
SRC      DFHMDF POS=(10,16),LENGTH=30,ATTRB=(UNPROT,FSET)
S11F     DFHMDF POS=(10,47),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLBNF   DFHMDF POS=(11,02),LENGTH=12,ATTRB=ASKIP,INITIAL='BENEFICIARY.'
BNF      DFHMDF POS=(11,16),LENGTH=30,ATTRB=(UNPROT,FSET)
S11G     DFHMDF POS=(11,47),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
MSG      DFHMDF POS=(22,01),LENGTH=78,ATTRB=(ASKIP,BRT)
FKEY     DFHMDF POS=(24,01),LENGTH=78,ATTRB=ASKIP,
               INITIAL='ENTER=PROCESS  PF3=END  PF9=OVERRIDE  CLEAR=CANCEL'
         DFHMSD TYPE=FINAL
         END
