BKCFMS    DFHMSD TYPE=&SYSPARM,MODE=INOUT,LANG=COBOL,
               STORAGE=AUTO,TIOAPFX=YES,CTRL=(FREEKB,FRSET)
BKCFMSS   DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,CTRL=(FREEKB,FRSET)
TTL      DFHMDF POS=(01,01),LENGTH=08,ATTRB=(ASKIP,BRT),
               INITIAL='BKCFMS'
TTL2     DFHMDF POS=(01,32),LENGTH=15,
               ATTRB=(ASKIP,BRT),INITIAL='CIF MAINTENANCE'
LINE2    DFHMDF POS=(02,01),LENGTH=78,ATTRB=ASKIP,
               INITIAL='------------------------------------------------------------------------------'
LBLCIF   DFHMDF POS=(04,02),LENGTH=12,ATTRB=ASKIP,INITIAL='CIF NO......'
CIFNO    DFHMDF POS=(04,16),LENGTH=10,ATTRB=(UNPROT,IC,FSET)
S3A      DFHMDF POS=(04,27),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLNAM   DFHMDF POS=(05,02),LENGTH=12,ATTRB=ASKIP,INITIAL='LEGAL NAME..'
CNAME    DFHMDF POS=(05,16),LENGTH=30,ATTRB=(UNPROT,FSET)
S3B      DFHMDF POS=(05,47),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLAD1   DFHMDF POS=(06,02),LENGTH=12,ATTRB=ASKIP,INITIAL='ADDR 1......'
ADDR1    DFHMDF POS=(06,16),LENGTH=40,ATTRB=(UNPROT,FSET)
S3C      DFHMDF POS=(06,57),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLAD2   DFHMDF POS=(07,02),LENGTH=12,ATTRB=ASKIP,INITIAL='ADDR 2......'
ADDR2    DFHMDF POS=(07,16),LENGTH=40,ATTRB=(UNPROT,FSET)
S3D      DFHMDF POS=(07,57),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLCTY   DFHMDF POS=(08,02),LENGTH=12,ATTRB=ASKIP,INITIAL='CITY........'
CITY     DFHMDF POS=(08,16),LENGTH=20,ATTRB=(UNPROT,FSET)
S3E      DFHMDF POS=(08,37),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLST    DFHMDF POS=(08,40),LENGTH=06,ATTRB=ASKIP,INITIAL='STATE.'
ST       DFHMDF POS=(08,47),LENGTH=02,ATTRB=(UNPROT,FSET)
S3F      DFHMDF POS=(08,50),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLZIP   DFHMDF POS=(09,02),LENGTH=12,ATTRB=ASKIP,INITIAL='POSTAL......'
ZIP      DFHMDF POS=(09,16),LENGTH=10,ATTRB=(UNPROT,FSET)
S3G      DFHMDF POS=(09,27),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLKYC   DFHMDF POS=(10,02),LENGTH=12,ATTRB=ASKIP,INITIAL='KYC STAT....'
KYC      DFHMDF POS=(10,16),LENGTH=01,ATTRB=(UNPROT,FSET)
S3H      DFHMDF POS=(10,18),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLRM    DFHMDF POS=(11,02),LENGTH=12,ATTRB=ASKIP,INITIAL='REL MGR.....'
RELMGR   DFHMDF POS=(11,16),LENGTH=08,ATTRB=(UNPROT,FSET)
S3I      DFHMDF POS=(11,25),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLDUAL  DFHMDF POS=(13,02),LENGTH=40,ATTRB=ASKIP,INITIAL='DUAL-CONTROL PENDING (Y/N):'
DUAL     DFHMDF POS=(13,44),LENGTH=01,ATTRB=ASKIP,INITIAL='N'
MSG      DFHMDF POS=(22,01),LENGTH=78,ATTRB=(ASKIP,BRT)
FKEY     DFHMDF POS=(24,01),LENGTH=78,ATTRB=ASKIP,
               INITIAL='ENTER=PROCESS  PF3=END  PF9=OVERRIDE  CLEAR=CANCEL'
         DFHMSD TYPE=FINAL
         END
