BKIQMS    DFHMSD TYPE=&SYSPARM,MODE=INOUT,LANG=COBOL,
               STORAGE=AUTO,TIOAPFX=YES,CTRL=(FREEKB,FRSET)
BKIQMSS   DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,CTRL=(FREEKB,FRSET)
TTL      DFHMDF POS=(01,01),LENGTH=08,ATTRB=(ASKIP,BRT),
               INITIAL='BKIQMS'
TTL2     DFHMDF POS=(01,27),LENGTH=25,
               ATTRB=(ASKIP,BRT),INITIAL='BALANCE / HISTORY INQUIRY'
LINE2    DFHMDF POS=(02,01),LENGTH=78,ATTRB=ASKIP,
               INITIAL='------------------------------------------------------------------------------'
LBLACC   DFHMDF POS=(04,02),LENGTH=12,ATTRB=ASKIP,INITIAL='ACCOUNT.....'
ACCNO    DFHMDF POS=(04,16),LENGTH=06,ATTRB=(UNPROT,IC,FSET)
S5A      DFHMDF POS=(04,23),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLNAM   DFHMDF POS=(05,02),LENGTH=12,ATTRB=ASKIP,INITIAL='NAME........'
CNAME    DFHMDF POS=(05,16),LENGTH=30,ATTRB=ASKIP
LBLSTS   DFHMDF POS=(06,02),LENGTH=12,ATTRB=ASKIP,INITIAL='STATUS......'
STS      DFHMDF POS=(06,16),LENGTH=01,ATTRB=ASKIP
LBLBAL   DFHMDF POS=(07,02),LENGTH=12,ATTRB=ASKIP,INITIAL='LEDGER......'
BAL      DFHMDF POS=(07,16),LENGTH=15,ATTRB=ASKIP
LBLHLD   DFHMDF POS=(08,02),LENGTH=12,ATTRB=ASKIP,INITIAL='HOLDS.......'
HOLD     DFHMDF POS=(08,16),LENGTH=15,ATTRB=ASKIP
LBLAVL   DFHMDF POS=(09,02),LENGTH=12,ATTRB=ASKIP,INITIAL='AVAILABLE...'
AVAIL    DFHMDF POS=(09,16),LENGTH=15,ATTRB=ASKIP
LBLLST   DFHMDF POS=(10,02),LENGTH=12,ATTRB=ASKIP,INITIAL='LAST POST...'
LASTP    DFHMDF POS=(10,16),LENGTH=26,ATTRB=ASKIP
HDR      DFHMDF POS=(12,02),LENGTH=50,ATTRB=ASKIP,INITIAL='TRACE                    DRCR      AMOUNT'
L1       DFHMDF POS=(13,02),LENGTH=70,ATTRB=ASKIP
L2       DFHMDF POS=(14,02),LENGTH=70,ATTRB=ASKIP
L3       DFHMDF POS=(15,02),LENGTH=70,ATTRB=ASKIP
L4       DFHMDF POS=(16,02),LENGTH=70,ATTRB=ASKIP
L5       DFHMDF POS=(17,02),LENGTH=70,ATTRB=ASKIP
MSG      DFHMDF POS=(22,01),LENGTH=78,ATTRB=(ASKIP,BRT)
FKEY     DFHMDF POS=(24,01),LENGTH=78,ATTRB=ASKIP,
               INITIAL='ENTER=PROCESS  PF3=END  PF9=OVERRIDE  CLEAR=CANCEL'
         DFHMSD TYPE=FINAL
         END
