BKSPMS    DFHMSD TYPE=&SYSPARM,MODE=INOUT,LANG=COBOL,
               STORAGE=AUTO,TIOAPFX=YES,CTRL=(FREEKB,FRSET)
BKSPMSS   DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,CTRL=(FREEKB,FRSET)
TTL      DFHMDF POS=(01,01),LENGTH=08,ATTRB=(ASKIP,BRT),
               INITIAL='BKSPMS'
TTL2     DFHMDF POS=(01,34),LENGTH=12,
               ATTRB=(ASKIP,BRT),INITIAL='STOP PAYMENT'
LINE2    DFHMDF POS=(02,01),LENGTH=78,ATTRB=ASKIP,
               INITIAL='------------------------------------------------------------------------------'
LBLACC   DFHMDF POS=(04,02),LENGTH=12,ATTRB=ASKIP,INITIAL='ACCOUNT.....'
ACCNO    DFHMDF POS=(04,16),LENGTH=06,ATTRB=(UNPROT,IC,FSET)
S9A      DFHMDF POS=(04,23),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLKND   DFHMDF POS=(05,02),LENGTH=12,ATTRB=ASKIP,INITIAL='KIND C/A/R..'
KIND     DFHMDF POS=(05,16),LENGTH=01,ATTRB=(UNPROT,FSET),INITIAL='C'
S9B      DFHMDF POS=(05,18),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLCK    DFHMDF POS=(06,02),LENGTH=12,ATTRB=ASKIP,INITIAL='CHECK NO....'
CHKNO    DFHMDF POS=(06,16),LENGTH=10,ATTRB=(UNPROT,FSET,NUM)
S9C      DFHMDF POS=(06,27),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLTH    DFHMDF POS=(07,02),LENGTH=12,ATTRB=ASKIP,INITIAL='THRU CHECK..'
CHKTH    DFHMDF POS=(07,16),LENGTH=10,ATTRB=(UNPROT,FSET,NUM)
S9D      DFHMDF POS=(07,27),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLAMT   DFHMDF POS=(08,02),LENGTH=12,ATTRB=ASKIP,INITIAL='AMOUNT......'
AMT      DFHMDF POS=(08,16),LENGTH=15,ATTRB=(UNPROT,FSET,NUM)
S9E      DFHMDF POS=(08,32),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLANY   DFHMDF POS=(09,02),LENGTH=12,ATTRB=ASKIP,INITIAL='AMT E/A.....'
AMTOP    DFHMDF POS=(09,16),LENGTH=01,ATTRB=(UNPROT,FSET),INITIAL='E'
S9F      DFHMDF POS=(09,18),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLPAY   DFHMDF POS=(10,02),LENGTH=12,ATTRB=ASKIP,INITIAL='PAYEE.......'
PAYEE    DFHMDF POS=(10,16),LENGTH=30,ATTRB=(UNPROT,FSET)
S9G      DFHMDF POS=(10,47),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLEXP   DFHMDF POS=(11,02),LENGTH=12,ATTRB=ASKIP,INITIAL='EXPIRE DTE..'
EXPDT    DFHMDF POS=(11,16),LENGTH=10,ATTRB=(UNPROT,FSET)
S9H      DFHMDF POS=(11,27),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
MSG      DFHMDF POS=(22,01),LENGTH=78,ATTRB=(ASKIP,BRT)
FKEY     DFHMDF POS=(24,01),LENGTH=78,ATTRB=ASKIP,
               INITIAL='ENTER=PROCESS  PF3=END  PF9=OVERRIDE  CLEAR=CANCEL'
         DFHMSD TYPE=FINAL
         END
