BKTRMS    DFHMSD TYPE=&SYSPARM,MODE=INOUT,LANG=COBOL,
               STORAGE=AUTO,TIOAPFX=YES,CTRL=(FREEKB,FRSET)
BKTRMSS   DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,CTRL=(FREEKB,FRSET)
TTL      DFHMDF POS=(01,01),LENGTH=08,ATTRB=(ASKIP,BRT),
               INITIAL='BKTRMS'
TTL2     DFHMDF POS=(01,33),LENGTH=14,
               ATTRB=(ASKIP,BRT),INITIAL='FUNDS TRANSFER'
LINE2    DFHMDF POS=(02,01),LENGTH=78,ATTRB=ASKIP,
               INITIAL='------------------------------------------------------------------------------'
LBLFR    DFHMDF POS=(04,02),LENGTH=12,ATTRB=ASKIP,INITIAL='FROM ACCT...'
FROMAC   DFHMDF POS=(04,16),LENGTH=06,ATTRB=(UNPROT,IC,FSET)
S7A      DFHMDF POS=(04,23),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLTO    DFHMDF POS=(05,02),LENGTH=12,ATTRB=ASKIP,INITIAL='TO ACCT.....'
TOAC     DFHMDF POS=(05,16),LENGTH=06,ATTRB=(UNPROT,FSET)
S7B      DFHMDF POS=(05,23),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLAMT   DFHMDF POS=(06,02),LENGTH=12,ATTRB=ASKIP,INITIAL='AMOUNT......'
AMT      DFHMDF POS=(06,16),LENGTH=15,ATTRB=(UNPROT,FSET,NUM)
S7C      DFHMDF POS=(06,32),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLNAR   DFHMDF POS=(07,02),LENGTH=12,ATTRB=ASKIP,INITIAL='NARRATIVE...'
NARR     DFHMDF POS=(07,16),LENGTH=40,ATTRB=(UNPROT,FSET)
S7D      DFHMDF POS=(07,57),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLFRB   DFHMDF POS=(09,02),LENGTH=12,ATTRB=ASKIP,INITIAL='FROM AVAIL..'
FRAVL    DFHMDF POS=(09,16),LENGTH=15,ATTRB=ASKIP
LBLTOB   DFHMDF POS=(10,02),LENGTH=12,ATTRB=ASKIP,INITIAL='TO LEDGER...'
TOBAL    DFHMDF POS=(10,16),LENGTH=15,ATTRB=ASKIP
NOTE     DFHMDF POS=(12,02),LENGTH=60,ATTRB=ASKIP,INITIAL='TWO JOURNAL ROWS SAME TRACE FAMILY; ONE SYNCPOINT'
MSG      DFHMDF POS=(22,01),LENGTH=78,ATTRB=(ASKIP,BRT)
FKEY     DFHMDF POS=(24,01),LENGTH=78,ATTRB=ASKIP,
               INITIAL='ENTER=PROCESS  PF3=END  PF9=OVERRIDE  CLEAR=CANCEL'
         DFHMSD TYPE=FINAL
         END
