BKWIMS    DFHMSD TYPE=&SYSPARM,MODE=INOUT,LANG=COBOL,
               STORAGE=AUTO,TIOAPFX=YES,CTRL=(FREEKB,FRSET)
BKWIMSS   DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,CTRL=(FREEKB,FRSET)
TTL      DFHMDF POS=(01,01),LENGTH=08,ATTRB=(ASKIP,BRT),
               INITIAL='BKWIMS'
TTL2     DFHMDF POS=(01,27),LENGTH=25,
               ATTRB=(ASKIP,BRT),INITIAL='WIRE IN / OUT (CORR-BANK)'
LINE2    DFHMDF POS=(02,01),LENGTH=78,ATTRB=ASKIP,
               INITIAL='------------------------------------------------------------------------------'
LBLREF   DFHMDF POS=(04,02),LENGTH=12,ATTRB=ASKIP,INITIAL='WIRE REF....'
WIREREF  DFHMDF POS=(04,16),LENGTH=16,ATTRB=(UNPROT,IC,FSET)
S8A      DFHMDF POS=(04,33),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLBIC   DFHMDF POS=(05,02),LENGTH=12,ATTRB=ASKIP,INITIAL='BIC / ABA...'
BIC      DFHMDF POS=(05,16),LENGTH=11,ATTRB=(UNPROT,FSET)
S8B      DFHMDF POS=(05,28),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLACC   DFHMDF POS=(06,02),LENGTH=12,ATTRB=ASKIP,INITIAL='OUR ACCT....'
ACCNO    DFHMDF POS=(06,16),LENGTH=06,ATTRB=(UNPROT,FSET)
S8C      DFHMDF POS=(06,23),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLAMT   DFHMDF POS=(07,02),LENGTH=12,ATTRB=ASKIP,INITIAL='AMOUNT......'
AMT      DFHMDF POS=(07,16),LENGTH=15,ATTRB=(UNPROT,FSET,NUM)
S8D      DFHMDF POS=(07,32),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLCCY   DFHMDF POS=(08,02),LENGTH=12,ATTRB=ASKIP,INITIAL='CCY.........'
CCY      DFHMDF POS=(08,16),LENGTH=03,ATTRB=(UNPROT,FSET),INITIAL='USD'
S8E      DFHMDF POS=(08,20),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLDIR   DFHMDF POS=(09,02),LENGTH=12,ATTRB=ASKIP,INITIAL='DIR I/O.....'
DIR      DFHMDF POS=(09,16),LENGTH=01,ATTRB=(UNPROT,FSET),INITIAL='I'
S8F      DFHMDF POS=(09,18),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
LBLOFAC  DFHMDF POS=(10,02),LENGTH=12,ATTRB=ASKIP,INITIAL='OFAC STAT...'
OFAC     DFHMDF POS=(10,16),LENGTH=01,ATTRB=ASKIP
LBLBNF   DFHMDF POS=(12,02),LENGTH=12,ATTRB=ASKIP,INITIAL='BENEFICIARY.'
BNF      DFHMDF POS=(12,16),LENGTH=40,ATTRB=(UNPROT,FSET)
S8G      DFHMDF POS=(12,57),LENGTH=01,ATTRB=ASKIP,INITIAL=' '
MSG      DFHMDF POS=(22,01),LENGTH=78,ATTRB=(ASKIP,BRT)
FKEY     DFHMDF POS=(24,01),LENGTH=78,ATTRB=ASKIP,
               INITIAL='ENTER=PROCESS  PF3=END  PF9=OVERRIDE  CLEAR=CANCEL'
         DFHMSD TYPE=FINAL
         END
