      *****************************************************************
      * BKBRN - Branch cash / vault
      *****************************************************************
       01  BK-BRANCH-CASH.
           05  BRN-NO               PIC X(6).
           05  BRN-VAULT            PIC S9(13)V99 COMP-3.
           05  BRN-TELLER-TOT       PIC S9(13)V99 COMP-3.
           05  BRN-IN-TRANSIT       PIC S9(13)V99 COMP-3.
           05  BRN-AS-OF            PIC X(10).
