      *****************************************************************
      * BKCIF - Customer information file
      *****************************************************************
       01  BK-CIF.
           05  CIF-NO               PIC X(10).
           05  CIF-NAME             PIC X(30).
           05  CIF-ADDR             PIC X(50).
           05  CIF-TAX-ID-HASH      PIC X(16).
           05  CIF-KYC-STAT         PIC X.
           05  CIF-REL-MGR          PIC X(8).
           05  CIF-TIN              PIC X(9).
           05  CIF-TIN-STAT         PIC X.
           05  CIF-OFAC-STAT        PIC X.
           05  CIF-DUAL-PEND        PIC X.
           05  CIF-STATE            PIC X(2).

